#### FindReferenceTarget Enumeration

---

|  |
| --- |
| See Also |

The type of reference to find from a ReferenceIntersector.

The type of reference to find

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum FindReferenceTarget ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FindReferenceTarget ``` |

| Visual C++ |
| --- |
| ``` public enum class FindReferenceTarget ``` |

# Members

| Member name | Description |
| --- | --- |
| Element | An element. |
| Mesh | A mesh. |
| Edge | An edge. |
| Curve | A curve. |
| Face | A face. |
| All | All target types. |

# See Also

Autodesk.Revit.DB Namespace